individualChapters/introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-21 St 21:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="John Doe" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50b0bee">1. Introduction</a>
<ul>
<li><a href="#org7639b39">1.1. Tools I recommend and rationale why to use them</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50b0bee" class="outline-2">
<h2 id="org50b0bee"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Technical writing is an art in its own. When writing a&nbspmanual, technical writer has to be the middle ground between software developers and users. As a&nbsptechnical writer you have to bring the subject matter, the software you are writing about, closer to its users. Very often you will have to cooperate directly with software developers and using version control tools such as <code>git</code>  <a href="#cite-gitWeb"><cite>(Official Webpage)</cite></a>. I&nbspfound it beneficial to use efficient tools that help you get the task done, and are also extensible to accommodate any need should arise from writing process.
</p>

<p>
That is why I&nbsphave decided to make this basic blog, suitable for beginners trying to find good workflow setup for their writing.
</p>
</div>

<div id="outline-container-org7639b39" class="outline-3">
<h3 id="org7639b39"><span class="section-number-3">1.1</span> Tools I&nbsprecommend and rationale why to use them</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As noted above, I&nbspprefer to use tools that are extensible and allow a&nbsplot of options to meet any requirements that I&nbspmay be facing during writing. The con is, as you might have guessed from the blog title, that these tools are often very complex. Also, I&nbspprefer to use open source tools whenever possible.
</p>

<p>
What does a&nbsptechnical writer need to do his job? For starters, it would be an <i>text editor</i>. That is a&nbspprogram that allows you to write text. Simple as that.
</p>

<p>
I would advise against writing in binary formats like <code>docx</code>  <a href="#cite-msword"><cite>(Official Webpage)</cite></a> and <code>odt</code>  <a href="#cite-libreOffice"><cite>(Official Webpage)</cite></a> (which are in fact archives of multiple files). The reason being is that it is actually more challenging to maintain consistent document structure and look with writing in those formats. From my experience, it is much more efficient to focus on content as a&nbspwriter, and leave upholding the formatting and overall consistency on another application.
</p>

<p>
For choosing a&nbsptext editor, well, the name of this blog is &ldquo;,&rdquo; and <code>org-mode</code>  <a href="#cite-orgModeOfficial"><cite>(Official Webpage)</cite></a> is a&nbspmarkup format native to program <code>GNU/Emacs</code>  <a href="#cite-gnuEmacs"><cite>(Official Webpage)</cite></a> (further referred to simply as <code>emacs</code>). Because <code>org-mode</code> is just a&nbspmarkup format, you can actually use any text editor to write text in <code>org-mode</code> markup. However, <code>emacs</code> has the best support for it. If you insist on using different text editor than <code>emacs</code>, some alternatives would be <code>vim</code>  <a href="#cite-vim"><cite>(Official Webpage)</cite></a> or <code>neovim</code>  <a href="#cite-neovim"><cite>(Official Webpage)</cite></a>, <code>atom</code>  <a href="#cite-atom"><cite>(Official Webpage)</cite></a> or <code>notepad++</code>  <a href="#cite-notepadpp"><cite>(Official Webpage)</cite></a>. In that case, you can skip chapters <span style="background-color:red">chapter references to chapters about</span> <code>emacs</code> <span style="background-color:red">and</span> <code>doom emacs</code> <span style="background-color:red">command shortcuts</span>, which are focused on specifics of working with <code>emacs</code>. But for the full span of these blog posts, I&nbspwill assume that you are using <code>emacs</code> as a&nbsptext editor.
</p>

<p>
I have chosen <code>org-mode</code> as format for technical writing because it allows great workflow management and is tightly integrated into <code>emacs</code>. But it is a&nbspmarkup format that is best used for documentation source, not its &ldquo;presentation&rdquo; form.
</p>

<p>
Nowadays most documentation has to be accessible from web, or must be compatible with web-based applications, which means we need our documentation in html format. Often is very handy having access to offline documentation, for which is best choice the pdf format. I&nbsppersonally have been facing requirements to provide documentation also in <code>.docx</code> or <code>.odt</code> formats.
</p>

<h2>References</h2>
<p> <a id="cite-gitWeb">[1] </a> <code>Git</code> Official Webpage: <a href="https://git-scm.com/">https://git-scm.com/</a> </p>
<p> <a id="cite-msword">[2] </a> Microsoft Office Word Official Webpage: <a href="https://www.microsoft.com/en-us/microsoft-365/word">https://www.microsoft.com/en-us/microsoft-365/word</a> </p>
<p> <a id="cite-libreOffice">[3] </a> Libre Office project Official Webpage: <a href="https://www.libreoffice.org/">https://www.libreoffice.org/</a> </p>
<p> <a id="cite-orgModeOfficial">[4] </a> Org mode project Official Webpage: <a href="https://orgmode.org/">https://orgmode.org/</a> </p>
<p> <a id="cite-emacsOfficial">[5] </a> Emacs Official Webpage: <a href="https://www.gnu.org/software/emacs/">https://www.gnu.org/software/emacs/</a> </p>
<p> <a id="cite-vimOfficial">[6] </a> Vim Official Webpage: <a href="https://www.vim.org/">https://www.vim.org/</a> </p>
<p> <a id="cite-neovimOfficial">[7] </a> Neovim Official Webpage: <a href="https://neovim.io/">https://neovim.io/</a> </p>
<p> <a id="cite-atomOfficial">[8] </a> Atom Text Editor Official Webpage: <a href="https://atom.io/">https://atom.io/</a> </p>
<p> <a id="cite-notepadppOfficial">[9] </a> Notepad++ Official Webpage: <a href="https://notepad-plus-plus.org/">https://notepad-plus-plus.org/</a> </p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2021-04-21 St 21:50</p>
</div>
</body>
</html>
